# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.
def func_for_sum():
    finish = "!"
    user_data = 0
    result_sum = 0
    if finish == user_data:
        print(f'Программа завершена. Сумма {result_sum}. ')
    while finish != user_data:
        user_data = input(f'Введи строку чисел, разделенных пробелом. '
                          f'Если хочешь завершить программу, введи {finish} ')
        numbers_for_sum = user_data.split()
        for number in numbers_for_sum:
            summund = float(number)
            result_sum = result_sum + summund
            print(result_sum)
    print(result_sum)
    return result_sum
func_for_sum()
# Не понимаю, как обработать введение ! и прекращение программы. Программа-то заканчивается, но некрасиво)