# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Первый — возведение в степень с помощью оператора **.
def mmy_func(x, y):
    return x ** y
print(mmy_func(0.0625, -2))
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
def my_func(x, y):
    degree = 1
    while degree < abs(y):
        x = x * x
        degree = degree + 1
    return 1 / x
print(my_func(0.0625, -2))
